_posts/2014-12-19-test.html
---
layout: post
title: test
date: 2014-12-19
categories: 
- test
- category1
author: tiankai
excerpt: some description
---
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">初步使用org2blog</h2>
<div class="outline-text-2" id="text-1">
<p>
首先我们需要测试一下org2blog的功能能不能正常的运行
</p>

<p>
SVN Note
</p>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">svn 安装</h2>
<div class="outline-text-2" id="text-2">
<p>
在ubuntu上:
</p>

<pre class="example">
sudo apt-get install subversion
</pre>

<p>
还有一个subversion的工具需要安装一下:
</p>

<pre class="example">
sudo apt-get install subversion-tools
</pre>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">svn使用笔记</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1">从远程仓库中copy一份文件(检出)</h3>
<div class="outline-text-3" id="text-3-1">
<p>
使用svn做版本控制的第一步一般都是从远程仓库中复制一个副本,使用的命令是:
</p>

<pre class="example">
svn checkout https//.... --username yourusername
</pre>

<p>
这个命令和git中的命令很不一样,个人感觉还是git中的命令比较直白,该命令等同
于git:中的命令:
</p>

<pre class="example">
git clone url-to-reposity
</pre>
</div>
</div>
<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2">将文件加入版本库</h3>
<div class="outline-text-3" id="text-3-2">
<pre class="example">
svn add filename
</pre>
</div>
</div>
<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3">commit</h3>
<div class="outline-text-3" id="text-3-3">
<pre class="example">
svn commit -m " some message"
</pre>
</div>
</div>
<div id="outline-container-sec-3-4" class="outline-3">
<h3 id="sec-3-4">update</h3>
<div class="outline-text-3" id="text-3-4">
<pre class="example">
svn update
svn update -r 
svn update file-name
</pre>
</div>
</div>
<div id="outline-container-sec-3-5" class="outline-3">
<h3 id="sec-3-5">merge</h3>
<div class="outline-text-3" id="text-3-5">
<p>
关于svn merge的内容建议看一下链接:<a href="http://svnbook.red-bean.com/en/1.6/svn.ref.svn.c.merge.html">点这里</a>. 
</p>
<div class="org-src-container">

<pre class="src src-zsh" id="svn-merge">$ svn merge --reintegrate http://svn.example.com/repos/calc/branches/my-calc-branch
--- Merging differences between repository URLs into '.':
U    button.c
U    integer.c
U    Makefile
U   .

$ # build, test, verify, ...

$ svn commit -m "Merge my-calc-branch back into trunk!"
Sending        .
Sending        button.c
Sending        integer.c
Sending        Makefile
Transmitting file data ..
Committed revision 391.
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-6" class="outline-3">
<h3 id="sec-3-6">冲突解决</h3>
<div class="outline-text-3" id="text-3-6">
<p>
使用版本控制软件和别人进行合作开发,避免不了冲突的产生,所以解决冲突是非常重要的技能.网上有一篇比较好的帖子:<a href="http://svnbook.red-bean.com/en/1.6/svn.ref.svn.c.resolve.html">点这里</a> <br  />
使用的命令: svn resolve PATH&#x2026;
</p>

<p>
Description
</p>

<p>
Resolve “conflicted” state on working copy files or directories. This routine does not semantically resolve conflict markers; however, it replaces PATH with the version specified by the &#x2013;accept argument and then removes conflict-related artifact files. This allows PATH to be committe again—that is, it tells Subversion that the conflicts have been “resolved.”. You can pass the following arguments to the &#x2013;accept command depending on your desired resolution:
</p>

<p>
base
Choose the file that was the BASE revision before you updated your working copy. That is, the file that you checked out before you made your latest edits.
</p>

<p>
working
Assuming that you've manually handled the conflict resolution, choose the version of the file as it currently stands in your working copy.
</p>

<p>
mine-full
Resolve all conflicted files with copies of the files as they stood immediately before you ran svn update.
</p>

<p>
theirs-full
Resolve all conflicted files with copies of the files that were fetched from the server when you ran svn update.
</p>

<p>
See the section called “Resolve Any Conflicts” for an in-depth look at resolving conflicts.
</p>
<div class="org-src-container">

<pre class="src src-zsh" id="svn-resolved-the-conflict">$ svn update
Conflict discovered in 'foo.c'.
Select: (p) postpone, (df) diff-full, (e) edit,
        (mc) mine-conflict, (tc) theirs-conflict,
        (s) show all options: p
C    foo.c
Updated to revision 5.
Summary of conflicts:
  Text conflicts: 1
$ svn resolve --accept mine-full foo.c
Resolved conflicted state of 'foo.c'
</pre>
</div>
</div>
</div>
</div>
